src/AccumulationRegisters/_ДемоОстаткиТоваровВМестахХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>_ДемоОстаткиТоваровВМестахХранения</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоМестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/_ДемоХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>_ДемоХозяйственныеОперации</Name>
			<Comment>Пример использования подсистемы "Управление доступом", когда доступ ограничивается по внутреннему типу документа (объекта)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗарплаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/_ДемоНачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>_ДемоНачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister._ДемоОсновныеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/_ДемоЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>_ДемоЗаказПокупателя</Name>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.Встреча</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef._ДемоСтатусыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Comment>Внутренние значения полей адреса доставки (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаДоставки</Name>
					<Comment>Страна доставки, вычисленная из адреса (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионДоставки</Name>
					<Comment>Регион доставки, вычисленный из адреса (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородДоставки</Name>
					<Comment>Город доставки, вычисленный из адреса (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Comment>Внутренние значения полей электронной почты (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоменноеИмяСервера</Name>
					<Comment>Вычисленный домен почтового сервера (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаказЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СчетаНаОплату</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._ДемоСчетНаОплатуПокупателю</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартнерыИКонтактныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоПартнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоКонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Comment>Тип</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Comment>Вид</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/_ДемоСтандартныеПодсистемы/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Демонстрационная конфигурация Библиотеки стандартных подсистем.
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы БазоваяФункциональность.

// См. комментарий к процедуре ДобавитьПереименование общего модуля ОбщегоНазначения.
Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
	
	// 2.0.1.14
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.0.1.14",
		"Роль._ДемоИспользованиеИнтерфейсаРаботыСЗадачами", "Роль._ДемоРазделБизнесПроцессыИЗадачи");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.0.1.14",
		"Роль._ДемоРаботаСПапкамиФайлов", "Роль.РаботаСПапкамиФайлов");
	
	// 2.1.2.5
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.5",
		"Подсистема._ДемоОбменДанными.Подсистема._ДемоНастройкаОбмена",
		"Подсистема._ДемоСинхронизацияДанных.Подсистема._ДемоНастройкаСинхронизации");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.5",
		"Подсистема._ДемоОбменДанными.Подсистема._ДемоОбъектыОбмена",
		"Подсистема._ДемоСинхронизацияДанных.Подсистема._ДемоОбъектыСинхронизации");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.5",
		"Подсистема._ДемоОбменДанными", "Подсистема._ДемоСинхронизацияДанных");
	
	// 2.1.2.7
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.7",
		"Подсистема._ДемоНастройкаИАдминистрирование",
		"Подсистема.НастройкаИАдминистрирование");
	
	// 2.1.2.14
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоАнкетирование.Подсистема._ДемоРеспонденты",
		"Подсистема._ДемоАнкетирование.Подсистема.Респонденты");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоАнкетирование.Подсистема._ДемоСозданиеАнкетИОпросов",
		"Подсистема._ДемоАнкетирование.Подсистема.СозданиеАнкетИОпросов");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоАнкетирование.Подсистема._ДемоУправлениеВнешнимиПользователями",
		"Подсистема._ДемоАнкетирование.Подсистема.УправлениеВнешнимиПользователями");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоАнкетирование.Подсистема._ДемоХодАнкетированияИАнализ",
		"Подсистема._ДемоАнкетирование.Подсистема.ХодАнкетированияИАнализ");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоБизнесПроцессыИЗадачи.Подсистема._ДемоИсполнениеЗадач",
		"Подсистема._ДемоБизнесПроцессыИЗадачи.Подсистема.ИсполнениеЗадач");
		
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоБизнесПроцессыИЗадачи.Подсистема._ДемоВыдачаЗаданий",
		"Подсистема._ДемоБизнесПроцессыИЗадачи.Подсистема.ВыдачаЗаданий");
		
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоБизнесПроцессыИЗадачи.Подсистема._ДемоКонтрольИсполнения",
		"Подсистема._ДемоБизнесПроцессыИЗадачи.Подсистема.КонтрольИсполнения");
		
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоБизнесПроцессыИЗадачи.Подсистема._ДемоНастройкаРолевойАдресации",
		"Подсистема._ДемоБизнесПроцессыИЗадачи.Подсистема.НастройкаРолевойАдресации");
		
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоБизнесПроцессыИЗадачи.Подсистема._ДемоМониторингЗадач",
		"Подсистема._ДемоБизнесПроцессыИЗадачи.Подсистема.МониторингЗадач");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоВерсионирование.Подсистема._ДемоВерсионированиеИспользование",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоВерсионирование.Подсистема.Использование");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоВерсионирование.Подсистема._ДемоВерсионированиеНастройка",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоВерсионирование.Подсистема.Настройка");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоДополнительныеОтчетыИОбработки.Подсистема._ДемоДополнительныеОтчетыИОбработкиИспользование",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоДополнительныеОтчетыИОбработки.Подсистема.Использование");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоДополнительныеОтчетыИОбработки.Подсистема._ДемоДополнительныеОтчетыИОбработкиНастройка",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоДополнительныеОтчетыИОбработки.Подсистема.Настройка");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоДополнительныеОтчетыИОбработки.Подсистема._ДемоДополнительныеОтчетыИОбработкиСлужебные",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоДополнительныеОтчетыИОбработки.Подсистема.Служебные");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоКонтактнаяИнформация.Подсистема._ДемоКонтактнаяИнформацияИспользование",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоКонтактнаяИнформация.Подсистема.Использование");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоКонтактнаяИнформация.Подсистема._ДемоКонтактнаяИнформацияНастройка",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоКонтактнаяИнформация.Подсистема.Настройка");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоКонтактнаяИнформация",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоКонтактнаяИнформация");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоПечать.Подсистема._ДемоПечатьНастройка",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоПечать.Подсистема.Настройка");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоПечать.Подсистема._ДемоПечатьИспользование",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоПечать.Подсистема.Использование");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоПечать",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоПечать");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоСвойства.Подсистема._ДемоСвойстваИспользование",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоСвойства.Подсистема.Использование");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоСвойства.Подсистема._ДемоСвойстваНастройка",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоСвойства.Подсистема.Настройка");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоРассылкиОтчетов",
		"Подсистема._ДемоСервисныеПодсистемы.Подсистема._ДемоРассылкиОтчетов");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоСвойства",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоСвойства");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоГрупповоеИзменениеОбъектов",
		"Подсистема._ДемоСервисныеПодсистемы.Подсистема._ДемоГрупповоеИзменениеОбъектов");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоДатыЗапретаИзменения.Подсистема._ДемоДатыЗапретаИзмененияВнутренниеДанные",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоДатыЗапретаИзменения.Подсистема.ВнутренниеДанные");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоДатыЗапретаИзменения.Подсистема._ДемоДатыЗапретаИзмененияИспользование",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоДатыЗапретаИзменения.Подсистема.Использование");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоДатыЗапретаИзменения.Подсистема._ДемоДатыЗапретаИзмененияНастройка",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоДатыЗапретаИзменения.Подсистема.Настройка");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоДатыЗапретаИзменения",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоДатыЗапретаИзменения");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоЗаметкиПользователя.Подсистема._ДемоЗаметкиПользователяВнутренниеДанные",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоЗаметкиПользователя.Подсистема.ВнутренниеДанные");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоЗаметкиПользователя.Подсистема._ДемоЗаметкиПользователяИспользование",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоЗаметкиПользователя.Подсистема.Использование");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоЗаметкиПользователя",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоЗаметкиПользователя");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоЗапретРедактированияРеквизитов",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоЗапретРедактированияРеквизитов");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоЗащитаПерсональныхДанных",
		"Подсистема._ДемоИнтегрируемыеПодсистемы.Подсистема._ДемоЗащитаПерсональныхДанных");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоНапоминанияПользователя",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоНапоминанияПользователя");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоИнтегрируемыеПодсистемыПродолжение.Подсистема._ДемоПрисоединенныеФайлы",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоПрисоединенныеФайлы");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоПодсистемы.Подсистема._ДемоБанки",
		"Подсистема._ДемоНормативноСправочнаяИнформация.Подсистема._ДемоБанки");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоПодсистемы.Подсистема._ДемоВалюты",
		"Подсистема._ДемоНормативноСправочнаяИнформация.Подсистема._ДемоВалюты");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоПодсистемы.Подсистема._ДемоВзаимодействия.Подсистема._ДемоВзаимодействияИспользование",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоВзаимодействия.Подсистема.Использование");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоПодсистемы.Подсистема._ДемоВзаимодействия.Подсистема._ДемоВзаимодействияНастройка",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоВзаимодействия.Подсистема.Настройка");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоПодсистемы.Подсистема._ДемоВзаимодействия",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоВзаимодействия");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоПодсистемы.Подсистема._ДемоКалендарныеГрафики",
		"Подсистема._ДемоНормативноСправочнаяИнформация.Подсистема._ДемоКалендарныеГрафики");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоПодсистемы.Подсистема._ДемоРаботаСПочтовымиСообщениями",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоРаботаСПочтовымиСообщениями");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоРаботаВМоделиСервиса.Подсистема._ДемоОбменСообщениями.Подсистема._ДемоОбменСообщениямиАдминистрирование",
		"Подсистема._ДемоРаботаВМоделиСервиса.Подсистема._ДемоОбменСообщениями.Подсистема.Администрирование");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоРаботаВМоделиСервиса.Подсистема._ДемоОбменСообщениями.Подсистема._ДемоОбменСообщениямиИспользование",
		"Подсистема._ДемоРаботаВМоделиСервиса.Подсистема._ДемоОбменСообщениями.Подсистема.Использование");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоРаботаВМоделиСервиса.Подсистема._ДемоОбменСообщениями.Подсистема._ДемоОбменСообщениямиНастройка",
		"Подсистема._ДемоРаботаВМоделиСервиса.Подсистема._ДемоОбменСообщениями.Подсистема.Настройка");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоРаботаВМоделиСервиса.Подсистема._ДемоРезервноеКопированиеОбластейДанных.Подсистема._ДемоРезервноеКопированиеАдминистрирование",
		"Подсистема._ДемоРаботаВМоделиСервиса.Подсистема._ДемоРезервноеКопированиеОбластейДанных.Подсистема.Администрирование");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоРаботаСФайлами.Подсистема._ДемоПрисоединенныеФайлы",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоРаботаСФайлами.Подсистема.ПрисоединенныеФайлы");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоРаботаСФайлами.Подсистема._ДемоРаботаСФайламиНастройка",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоРаботаСФайлами.Подсистема.Настройка");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоРаботаСФайлами",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоРаботаСФайлами");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоУправлениеДоступом.Подсистема._ДемоУправлениеДоступомНастройка",
		"Подсистема._ДемоУправлениеДоступом.Подсистема.Настройка");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоУправлениеДоступом.Подсистема._ДемоУправлениеДоступомИспользование",
		"Подсистема._ДемоУправлениеДоступом.Подсистема.Использование");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоУправлениеДоступом.Подсистема._ДемоУправлениеДоступомВнутренниеДанные",
		"Подсистема._ДемоУправлениеДоступом.Подсистема.ВнутренниеДанные");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.1.2.14",
		"Подсистема._ДемоПодсистемы",
		"Подсистема._ДемоСервисныеПодсистемы");
	
	// 2.2.1.31
	ОбщегоНазначения.ДобавитьПереименование(Итог, "2.2.1.31",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоРаботаСФайлами.Подсистема.Настройка",
		"Подсистема._ДемоОрганайзер.Подсистема._ДемоРаботаСФайлами.Подсистема.НастройкаИОбслуживание");
	
КонецПроцедуры

// См. комментарий к одноименной процедуре в модуле ОбщегоНазначенияПереопределяемый.
Процедура ПриОпределенииОбщихПараметровБазовойФункциональности(ОбщиеПараметры) Экспорт
	
	ОбщиеПараметры.ИмяФормыПерсональныхНастроек = "ОбщаяФорма._ДемоМоиНастройки";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы УправлениеДоступом.

// См. комментарий к одноименной процедуре в модуле УправлениеДоступомПереопределяемый.
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "_ДемоГруппыНоменклатуры";
	ВидДоступа.Представление    = НСтр("ru = 'Демо: Группы номенклатуры'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка._ДемоНоменклатура");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка._ДемоГруппыДоступаНоменклатуры");
	УправлениеДоступом.ДобавитьДополнительныеТипыВидаДоступа(ВидДоступа,
		Тип("СправочникСсылка._ДемоВидыНоменклатуры"),
		Тип("СправочникСсылка._ДемоГруппыДоступаНоменклатуры"));
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "_ДемоМестаХранения";
	ВидДоступа.Представление = НСтр("ru = 'Демо: Места хранения'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка._ДемоМестаХранения");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "_ДемоГруппыПартнеров";
	ВидДоступа.Представление    = НСтр("ru = 'Демо: Группы партнеров'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка._ДемоПартнеры");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка._ДемоГруппыДоступаПартнеров");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "_ДемоФизическиеЛица";
	ВидДоступа.Представление    = НСтр("ru = 'Демо: Физические лица'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка._ДемоФизическиеЛица");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "_ДемоХозяйственныеОперации";
	ВидДоступа.Представление = НСтр("ru = 'Демо: Хозяйственные операции'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка._ДемоХозяйственныеОперации");
	
КонецПроцедуры

// См. комментарий к одноименной процедуре в модуле УправлениеДоступомПереопределяемый.
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей) Экспорт
	
#Область Пользователь
	// Профиль "Пользователь".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Пользователь";
	ОписаниеПрофиля.Идентификатор = "09e56dbf-90a0-11de-862c-001d600d9ad2";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователь'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Общие разрешенные действия для большинства пользователей.
		           |Как правило, это права на просмотр данных информационной системы.'");
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	// Использование НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	// Типовые возможности.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСтруктурыПодчиненности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеТекущихДел");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("_ДемоРазделБизнесПроцессыИЗадачи");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеЗаданийСРолевойАдресацией");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоМестаХранения");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоГруппыПартнеров");
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоГруппыНоменклатуры");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область Бухгалтер
	// Профиль "Бухгалтер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Бухгалтер";
	ОписаниеПрофиля.Идентификатор = "75fa0eca-98aa-11df-b54f-e0cb4ed5f655";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Бухгалтер'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Демонстрирует использование
		           |- предустановленных видов доступа. Например, в отличие от профиля ""Руководитель""
		           |бухгалтерам разрешено редактировать документы ""Демо: Расходный кассовый ордер"" с типом
		           |хозяйственной операции - ""Выдача денежных средств подотчет"".
		           |- изменение как правило недоступных свойств объекта (на примере персональных данных физического лица).'");
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	// Использование НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	// Типовые возможности.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСтруктурыПодчиненности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеТекущихДел");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеКассовыхДокументов");
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоМестаХранения",         "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",                "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоГруппыПартнеров",       "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи",               "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоХозяйственныеОперации", "Предустановленный");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("_ДемоХозяйственныеОперации",
		"Перечисление._ДемоХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("_ДемоХозяйственныеОперации",
		"Перечисление._ДемоХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область РасчетчикЗарплаты
	// Профиль "Расчетчик зарплаты".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "РасчетчикЗарплаты";
	ОписаниеПрофиля.Идентификатор = "11851213-0f5f-11e0-96c1-e0cb4ed5f655";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Расчетчик зарплаты'");
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	// Использование НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	// Типовые возможности.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеТекущихДел");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеЗарплаты");
	// Виды ограничения доступа профиля.
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область Менеджер
	// Профиль "Менеджер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Менеджер";
	ОписаниеПрофиля.Идентификатор = "c7e34f11-9890-11df-b54f-e0cb4ed5f655";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для настройки групп доступа, демонстрирующих
		           |работу пользователей по вводу и изменению данных различных подсистем в разрезе различных
		           |видов доступа. В частности:
		           |- проведение и анализ результатов опросов (подсистема ""Анкетирование"");
		           |- ведение дополнительных сведений (подсистема ""Свойства"");
		           |- редактирование проектов и их присоединенных файлов (подсистема ""Присоединенные файлы"").
		           |
		           |Кроме того, в отличие от профилей ""Руководитель"" и ""Бухгалтер"", менеджерам вообще
		           |не доступны документы ""Демо: Расходный кассовый ордер"".'");
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	// Использование НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	// Типовые возможности.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСтруктурыПодчиненности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭП");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеТекущихДел");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("_ДемоПечатьСчетаНаОплатуНаПринтер");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОпросов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтветовНаВопросыАнкет");
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоМестаХранения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоГруппыПартнеров");
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоГруппыНоменклатуры");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область Руководитель
	// Профиль "Руководитель".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Руководитель";
	ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Руководитель'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для создания групп доступа, демонстрирующих
		           |использование предустановленных видов доступа. Например, в отличие от профиля ""Бухгалтер""
		           |руководителю разрешено редактировать документы ""Демо: Расходный кассовый ордер"" с типом 
		           |хозяйственной операции - ""Выдача зарплаты"", а персональные данные физических лиц - только просматривать.'");
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	// Использование НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	// Типовые возможности.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСтруктурыПодчиненности");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭП");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеТекущихДел");
	// Административные возможности.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеКассовыхДокументов");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеЗарплаты");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеДанныхДляОтветовНаВопросыАнкет");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеДанныхОбъектовАвторизации");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеДанныхРеспондентов");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеЗаданийСРолевойАдресацией");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнешнихПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтветовНаВопросыАнкет");
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоХозяйственныеОперации", "Предустановленный");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("_ДемоХозяйственныеОперации",
		"Перечисление._ДемоХозяйственныеОперации.ВыдачаЗарплаты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область ОтветственныйЗаВедениеВзаимодействий
	// Профиль "Ответственный за ведение взаимодействий".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеВзаимодействий";
	ОписаниеПрофиля.Идентификатор = "62e89fcd-9a4c-11df-8c0e-0011d8570cdf";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение взаимодействий'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Ведение взаимодействий с клиентами, поставщиками, партнерами и т.п. по электронной почте и телефону,
		           |а также планирование встреч (подсистема ""Взаимодействия"").'");
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	// Использование НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеТекущихДел");
	// Типовые возможности.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСтруктурыПодчиненности");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область Респондент
	// Профиль "Респондент".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Респондент";
	ОписаниеПрофиля.Идентификатор = "67b8f689-ee30-11de-a1c1-005056c00008";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Респондент'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для внешних пользователей, которые участвуют в опросах
		           |(подсистемы ""Анкетирование"" и ""Внешние пользователи"").'");
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоВнешнегоПользователя");
	// Использование НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеДанныхДляОтветовНаВопросыАнкет");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеДанныхОбъектовАвторизации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтветовНаВопросыАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтветовНаВопросыАнкет");
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВнешниеПользователи", "Предустановленный");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область ОтветственныйЗаНормативноСправочнуюИнформацию
	// Профиль "Ответственный за нормативно-справочную информацию".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаНСИ";
	ОписаниеПрофиля.Идентификатор = "09e56dbf-90a0-11de-862c-001d600d9fe2";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за нормативно-справочную информацию'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Ведение и обновление классификаторов, различной нормативно-справочной информации.'");
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("_ДемоБазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("_ДемоИспользованиеБСП");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	ОписаниеПрофиля.Роли.Добавить("_ДемоМоиНастройки");
	// Изменение НСИ, в том числе и стран мира
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбщейБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеНСИ");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
	// Дополнительные профили, которые не используются самостоятельно при настройке
	// прав пользователя, а дополняют основные профили, перечисленные выше.
	
#Область ОтветственныйЗаСоставыУчастниковГруппДоступа
	// Профиль "Ответственный за составы участников групп доступа (дополнительно)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаСоставыУчастниковГруппДоступа";
	ОписаниеПрофиля.Идентификатор = "588438ff-e954-11de-8634-001d600d9ad2";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за составы участников групп доступа (дополнительно)'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Назначается тем пользователям, у которых должна быть
		           |возможность изменять состав участников своих групп доступа.'");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("ИзменениеУчастниковГруппДоступа");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область ОтветственныйЗаВедениеНоменклатуры
	// Профиль "Ответственный за ведение номенклатуры (дополнительно)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеНоменклатуры";
	ОписаниеПрофиля.Идентификатор = "d348b8f5-1437-11e2-bb53-005056c00008";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение номенклатуры (дополнительно)'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Назначается тем пользователям, которые будут добавлять или изменять номенклатуру.'");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеНоменклатуры");
	// Работа с НСИ только в части стран мира
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтранМира");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область ОтветственныйЗаСписокВнешнихПользователей
	// Профиль "Ответственный за список внешних пользователей (дополнительно)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаСписокВнешнихПользователей";
	ОписаниеПрофиля.Идентификатор = "14401b24-3591-11df-863c-001d600d9ad2";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за список внешних пользователей (дополнительно)'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Дополнительно назначается тем пользователям, которым должна быть
		           |доступна возможность добавления и редактирования свойств внешних пользователей
		           |(подсистема ""Внешние пользователи"").'");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнешнихПользователей");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область НастройкаСинхронизацииДанных
	// Профиль "Настройка синхронизации данных (дополнительно)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "НастройкаСинхронизацииДанных";
	ОписаниеПрофиля.Идентификатор = "04937802-5dba-11df-a1d4-005056c00008";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Настройка синхронизации данных (дополнительно)'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Дополнительно назначается тем пользователям, которым должна быть
		           |доступна настройка синхронизации данных с другими программами
		           |(подсистема ""Обмен данными"").'");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("_ДемоДобавлениеИзменениеУзловПлановОбмена");
	ОписаниеПрофиля.Роли.Добавить("_ДемоЧтениеНСИ");
	ОписаниеПрофиля.Роли.Добавить("НастройкаСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОВерсияхОбъектов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область ИспользованиеЭлектроннойПочты
	// Профиль "Использование электронной почты (дополнительно)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ИспользованиеЭлектроннойПочты";
	ОписаниеПрофиля.Идентификатор = "588438ff-e854-11de-8634-001d600d9ad1";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Использование электронной почты (дополнительно)'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Дополнительно назначается тем пользователям, которым должны быть
		           |доступны различные функции получения и отправки электронной почты,
		           |имеющиеся в системе.'");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУчетныхЗаписейЭлектроннойПочты");
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область ПечатьНепроведенныхДокументов
	// Профиль "Печать непроведенных документов (дополнительно)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ПечатьНепроведенныхДокументов";
	ОписаниеПрофиля.Идентификатор = "c944ca49-dfee-11de-8632-001d600d9ad2";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Печать непроведенных документов (дополнительно)'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Дополнительно назначается тем пользователям, которым должна быть
		           |доступна печать непроведенных документов.
		           |Демонстрирует использование функции ЕстьРоль()
		           |с использованием параметра НаборыЗначенийДоступа.'");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("_ДемоПечатьНепроведенныхДокументов");
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("_ДемоМестаХранения");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
#Область РаботаСПапкамиФайлов
	// Профиль "Работа с папками файлов (дополнительно)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "РаботаСПапкамиФайлов";
	ОписаниеПрофиля.Идентификатор = "a8f63f6c-ced9-11de-862f-001d600d9ad2";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Работа с папками файлов (дополнительно)'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Дополнительно назначается тем пользователям, которым разрешено 
		           |работать с папками файлов (подсистема ""Работа с файлами"").'");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("РаботаСПапкамиФайлов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
	
КонецПроцедуры

// См. комментарий к одноименной процедуре в модуле УправлениеДоступомПереопределяемый.
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	// Для задач бизнес-процесса "Демо: Задание с ролевой адресацией".
	Строка = ЗависимостиПрав.Добавить();
	Строка.ПодчиненнаяТаблица = "Задача.ЗадачаИсполнителя";
	Строка.ВедущаяТаблица     = "БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией";
	
КонецПроцедуры

// См. комментарий к одноименной процедуре в модуле УправлениеДоступомПереопределяемый.
Процедура ПриЗаполненииИспользованияВидаДоступа(ИмяВидаДоступа, Использование) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ИмяВидаДоступа = "_ДемоГруппыНоменклатуры" Тогда
		Использование = Константы._ДемоОграничиватьДоступПоНоменклатуре.Получить();
		
	ИначеЕсли ИмяВидаДоступа = "_ДемоГруппыПартнеров" Тогда
		Использование = Константы._ДемоОграничиватьДоступПоПартнерам.Получить();
		
	ИначеЕсли ИмяВидаДоступа = "_ДемоФизическиеЛица" Тогда
		Использование = Константы._ДемоОграничиватьДоступПоФизическимЛицам.Получить();
	КонецЕсли;
	
КонецПроцедуры

// См. комментарий к одноименной процедуре в модуле УправлениеДоступомПереопределяемый.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	// _ДемоБизнесПроцессыИЗадачи
	Описание = Описание + 
	"
	|БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией.Чтение.Объект.БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией
	|БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией.Изменение.Объект.БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией
	|РегистрСведений.ИсполнителиЗадач.Чтение.Организации
	|РегистрСведений.ИсполнителиЗадач.Изменение.Организации
	|";
	
	// _ДемоОрганизации
	Описание = Описание + 
	"
	|Справочник.Организации.Чтение.Организации
	|";
	
	// _ДемоРаботаСФайлами
	Описание = Описание + 
	"
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ._ДемоЗаказПокупателя
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник._ДемоПартнеры
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.Задание
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ._ДемоЗаказПокупателя
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник._ДемоПартнеры
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией
	|Справочник.Файлы.Чтение.Объект.Документ._ДемоЗаказПокупателя
	|Справочник.Файлы.Чтение.Объект.Справочник._ДемоПартнеры
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией
	|Справочник.Файлы.Изменение.Объект.Документ._ДемоЗаказПокупателя
	|Справочник.Файлы.Изменение.Объект.Справочник._ДемоПартнеры
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.Документ._ДемоЗаказПокупателя
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.Справочник._ДемоПартнеры
	|";
	
	// _ДемоУправлениеДоступом
	Описание = Описание + 
	"
	|Справочник._ДемоВидыНоменклатуры.Изменение._ДемоГруппыНоменклатуры
	|Справочник._ДемоНоменклатура.Изменение._ДемоГруппыНоменклатуры
	|Справочник._ДемоНоменклатураПрисоединенныеФайлы.Изменение._ДемоГруппыНоменклатуры
	|";
	
	
	// Другие демо-объекты.
	Описание = Описание + 
	"
	|Справочник._ДемоМестаХранения.Чтение._ДемоМестаХранения
	|Справочник._ДемоКонтрагенты.Чтение._ДемоГруппыПартнеров
	|Справочник._ДемоПартнеры.Чтение._ДемоГруппыПартнеров
	|Справочник._ДемоПроекты.Чтение.Организации
	|Справочник._ДемоПроекты.Изменение.Организации
	|Справочник._ДемоПроектыПрисоединенныеФайлы.Чтение.Организации
	|Справочник._ДемоПроектыПрисоединенныеФайлы.Изменение.Организации
	|Документ._ДемоНачислениеЗарплаты.Чтение.Объект.Документ._ДемоНачислениеЗарплаты
	|Документ._ДемоНачислениеЗарплаты.Изменение.Объект.Документ._ДемоНачислениеЗарплаты
	|Документ._ДемоЗаказПокупателя.Чтение.Организации
	|Документ._ДемоЗаказПокупателя.Чтение._ДемоГруппыПартнеров
	|Документ._ДемоЗаказПокупателя.Изменение.Организации
	|Документ._ДемоЗаказПокупателя.Изменение._ДемоГруппыПартнеров
	|Документ._ДемоОприходованиеТоваров.Чтение._ДемоМестаХранения
	|Документ._ДемоОприходованиеТоваров.Чтение.Организации
	|Документ._ДемоОприходованиеТоваров.Изменение._ДемоМестаХранения
	|Документ._ДемоОприходованиеТоваров.Изменение.Организации
	|Документ._ДемоОприходованиеТоваров.Изменение.Пользователи
	|Документ._ДемоПеремещениеТоваров.Чтение._ДемоМестаХранения
	|Документ._ДемоПеремещениеТоваров.Чтение.Организации
	|Документ._ДемоПеремещениеТоваров.Изменение._ДемоМестаХранения
	|Документ._ДемоПеремещениеТоваров.Изменение.Организации
	|Документ._ДемоПеремещениеТоваров.Изменение.Пользователи
	|Документ._ДемоРасходныйКассовыйОрдер.Чтение.Организации
	|Документ._ДемоРасходныйКассовыйОрдер.Чтение._ДемоХозяйственныеОперации
	|Документ._ДемоРасходныйКассовыйОрдер.Изменение.Организации
	|Документ._ДемоРасходныйКассовыйОрдер.Изменение._ДемоХозяйственныеОперации
	|Документ._ДемоСписаниеТоваров.Чтение._ДемоМестаХранения
	|Документ._ДемоСписаниеТоваров.Чтение.Организации
	|Документ._ДемоСписаниеТоваров.Изменение._ДемоМестаХранения
	|Документ._ДемоСписаниеТоваров.Изменение.Организации
	|Документ._ДемоСписаниеТоваров.Изменение.Пользователи
	|ЖурналДокументов._ДемоСкладскиеДокументы.Чтение.Объект.Документ._ДемоОприходованиеТоваров
	|ЖурналДокументов._ДемоСкладскиеДокументы.Чтение.Объект.Документ._ДемоПеремещениеТоваров
	|ЖурналДокументов._ДемоСкладскиеДокументы.Чтение.Объект.Документ._ДемоСписаниеТоваров
	|РегистрНакопления._ДемоОстаткиТоваровВМестахХранения.Чтение._ДемоМестаХранения
	|РегистрНакопления._ДемоОстаткиТоваровВМестахХранения.Чтение.Организации
	|";
	
КонецПроцедуры

// См. комментарий к одноименной процедуре в модуле УправлениеДоступомПереопределяемый.
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	ПолноеИмя = Ссылка.Метаданные().ПолноеИмя();
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Файлы")
	 ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка._ДемоЗаказПокупателя") Тогда
		
		// Зависимые типы объектов:
		
		//  БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	_ДемоЗаданиеСРолевойАдресацией.Ссылка
		|ИЗ
		|	БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией КАК _ДемоЗаданиеСРолевойАдресацией
		|ГДЕ
		|	_ДемоЗаданиеСРолевойАдресацией.Предмет = &Предмет");
		Запрос.УстановитьПараметр("Предмет", Ссылка.Метаданные().ПолноеИмя());
		СсылкиНаЗависимыеОбъекты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий демонстрационных объектов.

// Вызывается из события ОбработкаЗаполнения модулей объектов демонстрационных документов.
Процедура ПриВводеНовогоЗаполнитьОрганизацию(Объект, ИмяРеквизита = "Организация") Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа._ДемоОсновнаяОрганизация КАК _ДемоОсновнаяОрганизация
	|		ПО Организации.Ссылка = _ДемоОсновнаяОрганизация.Значение";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект[ИмяРеквизита] = Выборка.Организация;
	КонецЕсли;
КонецПроцедуры
